lib/zuora-core/src/test/resources/GWTermEndsBeforeInvoiceDate.json

{
  "success": true,
  "id": "id",
  "accountId": "id",
  "accountNumber": "acno",
  "accountName": "acname",
  "invoiceOwnerAccountId": "id",
  "invoiceOwnerAccountNumber": "acno",
  "invoiceOwnerAccountName": "acname",
  "subscriptionNumber": "snum",
  "version": 1,
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2019-04-23",
  "serviceActivationDate": "2019-04-23",
  "customerAcceptanceDate": "2019-06-14",
  "subscriptionStartDate": "2019-04-23",
  "termStartDate": "2019-04-23",
  "termEndDate": "2020-04-23",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "contractedMrr": 20.43,
  "totalContractedValue": 216.46,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "OpportunityName__QT": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "CpqBundleJsonId__QT": null,
  "QuoteType__QT": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": "SE",
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "ratePlans": [
    {
      "id": "id",
      "productId": "id",
      "productName": "Guardian Weekly - Domestic",
      "productSku": "ABC-00000029",
      "productRatePlanId": "id",
      "ratePlanName": "GW Oct 18 - Six for Six - Domestic",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "id",
          "productRatePlanChargeId": "id",
          "number": "C-01598224",
          "name": "GW Oct 18 - First 6 issues - Domestic",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "EUR6",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "EUR",
          "price": 6.000000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Specific_Weeks",
          "specificBillingPeriod": 6,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2019-05-03",
          "effectiveEndDate": "2019-06-14",
          "processedThroughDate": "2019-06-14",
          "chargedThroughDate": "2019-06-14",
          "done": true,
          "triggerDate": "2019-05-03",
          "triggerEvent": "SpecificDate",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Billing_Periods",
          "upToPeriods": 1,
          "specificEndDate": null,
          "mrr": 4.285714286,
          "dmrc": 4.285714286,
          "tcv": 6.000000000,
          "dtcv": 6.000000000,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    },
    {
      "id": "id",
      "productId": "id",
      "productName": "Guardian Weekly - Domestic",
      "productSku": "ABC-00000029",
      "productRatePlanId": "id",
      "ratePlanName": "GW Oct 18 - Quarterly - Domestic",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "id",
          "productRatePlanChargeId": "id",
          "number": "C-01598225",
          "name": "GW Oct 18 - Quarterly - Domestic",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "EUR61.3",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "EUR",
          "price": 61.300000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Quarter",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2019-06-14",
          "effectiveEndDate": "2020-04-23",
          "processedThroughDate": "2020-03-14",
          "chargedThroughDate": "2020-06-14",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 20.433333333,
          "dmrc": 20.433333333,
          "tcv": 210.463333333,
          "dtcv": 210.463333333,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    }
  ]
}
